In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1. Find invalid values in the data and replace them either with a correct value (if possible) or with NaN.
data = pd.read_csv('13-data.csv')
data

        sex  location  purchases  retention_time
0    female  Helsinki        7.0            57.1
1    female  Helsinki        5.0             NaN
2    female     Turku        8.0            50.6
3      male  Helsinki        5.0            31.7
4    female  Helsinki        2.0           120.0
..      ...       ...        ...             ...
195    male     Turku        3.0            40.5
196    male  Helsinki        3.0            36.9
197  female  Helsinki        6.0            59.2
198    male  Helsinki        5.0            31.8
199  female  Helsinki        6.0           181.9

[200 rows x 4 columns]

In [174]:
data['sex']

0      female
1      female
2      female
3        male
4      female
        ...
195      male
196      male
197    female
198      male
199    female
Name: sex, Length: 200, dtype: object

In [175]:
# amount of females and males
female = (data['sex'] == 'female').sum()
male = (data['sex'] == 'male').sum()
male + female

199

In [176]:
data.sex.value_counts()

sex
male      112
female     87
nale        1
Name: count, dtype: int64

In [177]:
data.sex.replace({'nale':'male'}, inplace=True)

In [178]:
data.sex.value_counts()

sex
male      113
female     87
Name: count, dtype: int64

In [179]:
data.location.value_counts()

location
Helsinki    92
Turku       70
Tampere     27
33100        8
20100        3
Name: count, dtype: int64

In [180]:
data.location.replace({'33100':'Tampere', '20100': 'Turku'}, inplace=True)

In [181]:
data.location.value_counts()

location
Helsinki    92
Turku       73
Tampere     35
Name: count, dtype: int64

In [182]:
# 2. Replace all missing values of the purchases variable with zero.
data.purchases.isna().sum()
data.purchases.fillna(0, inplace=True)

In [183]:
data.purchases.isna().sum()

0

In [184]:
data.purchases.value_counts().sum()

200

In [185]:
# 3. Use median imputation to fill in all missing values of the retention_time variable.
# (BONUS) Group the observations by sex and location before calculating the substitute median(s).

In [188]:
data.retention_time = data.retention_time.apply(lambda value: abs(value) if value < 0 else value)

In [189]:
grouped = data.groupby(['sex', 'location'])

In [190]:
data.retention_time = grouped.retention_time.transform(lambda group: group.fillna(group.mean()))

In [200]:
data

        sex  location  purchases  retention_time
0    female  Helsinki          7            57.1
1    female  Helsinki          5            63.1
2    female     Turku          8            50.6
3      male  Helsinki          5            31.7
4    female  Helsinki          2           120.0
..      ...       ...        ...             ...
195    male     Turku          3            40.5
196    male  Helsinki          3            36.9
197  female  Helsinki          6            59.2
198    male  Helsinki          5            31.8
199  female  Helsinki          6           181.9

[200 rows x 4 columns]

In [201]:
data.purchases = data.purchases.astype(int)

In [202]:
data.retention_time = data.retention_time.round(1)

In [203]:
data.to_csv('exercise_3.csv', index=False)